<?php

class Responses
{
    public function getResponses()
    {
        return [
            'Ага, тримай рота ширше',
            'Шо ти мелеш? Насцяв тобі на лице',
            'Насцяв тобі на капелюх',
            "Посцяв тобі на лице",
	        "Пісьнув тобі на картуза",
	        "Оросив твоє чоло сечею",
	        "Вмив твій золотий лик сечею",
	        "Пустив Живчика тобі на капелюх, ознайомся",
	        "Пустив струмінь на твою блискучу маківку",
	        "Сциконув тобі у вушко, зверни увагу",
	        "Насцяв тобі за шиворот, перевіряй",
	        "Залляв божою росою твої ясні очі",
            'Ти шо в сосну в\'їбався ?',
            'Знову нажерся?',
        ];
    }

    public function getRandomResponse(): string
    {
        $responses = $this->getResponses();
        return $responses[array_rand($responses)];
    }
}
